# -*- mode: org; fill-column: 78; -*-
# Time-stamp: <2026-01-03 19:02:55 krylon>
#
#+TAGS: internals(i) ui(u) bug(b) feature(f)
#+TAGS: database(d) design(e), meditation(m)
#+TAGS: optimize(o) refactor(r) cleanup(c)
#+TODO: TODO(t)  RESEARCH(r) IMPLEMENT(i) TEST(e) | DONE(d) FAILED(f) CANCELLED(c)
#+TODO: MEDITATE(m) PLANNING(p) | SUSPENDED(s)
#+PRIORITIES: A G D

* PyKuang [9/12]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :VISIBILITY: children
  :END:
** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 255 :emphasize t
   #+CAPTION: Clock summary at [2026-01-03 Sa 19:02]
   | Headline                                     | Time      |           |         |      |      |
   |----------------------------------------------+-----------+-----------+---------+------+------|
   | *Total time*                                 | *3d 2:40* |           |         |      |      |
   |----------------------------------------------+-----------+-----------+---------+------+------|
   | *PyKuang [9/12]*                             | *3d 2:40* |           |         |      |      |
   | \_  /Components [9/12]/                      |           | /3d 2:40/ |         |      |      |
   | \_    Common [1/1]                           |           |           |    0:08 |      |      |
   | \_      Make TTY logging configurable        |           |           |         | 0:08 |      |
   | \_    Model [0/0]                            |           |           |    0:25 |      |      |
   | \_    Database [2/3]                         |           |           |    8:16 |      |      |
   | \_      Add support for zone transfers       |           |           |         | 3:41 |      |
   | \_      Implement methods to deal with ports |           |           |         | 2:13 |      |
   | \_    Cache [0/0]                            |           |           |    1:45 |      |      |
   | \_    Generator [0/0]                        |           |           |    4:14 |      |      |
   | \_    Blacklist [0/0]                        |           |           |    3:59 |      |      |
   | \_    Scanner [6/7]                          |           |           |   22:01 |      |      |
   | \_      Be specific, please [5/5]            |           |           |         | 4:34 |      |
   | \_        Telnet                             |           |           |         |      | 0:54 |
   | \_        Finger                             |           |           |         |      | 0:17 |
   | \_      Rethink the interface                |           |           |         | 2:46 |      |
   | \_    XFR [0/1]                              |           |           | 1d 6:29 |      |      |
   | \_      Figure out the mechanics             |           |           |         | 3:06 |      |
   | \_    Nexus [0/0]                            |           |           |    3:23 |      |      |
   | \_      Control [0/0]                        |           |           |         | 1:09 |      |
   #+END:
** Features [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
** Components [9/12]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
*** Common [1/1]
**** DONE Make TTY logging configurable
     CLOSED: [2025-12-12 Fr 16:06]
     :LOGBOOK:
     CLOCK: [2025-12-12 Fr 15:58]--[2025-12-12 Fr 16:06] =>  0:08
     :END:
     When running the ParallelGenerator from a terminal, the output of log
     messages is overwhelming.
     I would like to either be able to turn off log output to the terminal, or
     set the minimum log level that gets emitted to the terminal.
*** Model [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-12-05 Fr 15:50]--[2025-12-05 Fr 16:15] =>  0:25
    :END:
*** Database [2/3]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-03 Sa 15:42]--[2026-01-03 Sa 16:03] =>  0:21
    CLOCK: [2025-12-08 Mo 15:46]--[2025-12-08 Mo 16:31] =>  0:45
    CLOCK: [2025-12-06 Sa 15:14]--[2025-12-06 Sa 15:35] =>  0:21
    CLOCK: [2025-12-05 Fr 16:15]--[2025-12-05 Fr 17:10] =>  0:55
    :END:
**** TODO Do proper exception handling
**** DONE Add support for zone transfers
     CLOSED: [2025-12-13 Sa 15:20]
     :LOGBOOK:
     CLOCK: [2025-12-13 Sa 14:18]--[2025-12-13 Sa 15:20] =>  1:02
     CLOCK: [2025-12-12 Fr 17:06]--[2025-12-12 Fr 19:45] =>  2:39
     :END:
**** DONE Implement methods to deal with ports
     CLOSED: [2025-12-27 Sa 16:55]
     :LOGBOOK:
     CLOCK: [2025-12-27 Sa 15:30]--[2025-12-27 Sa 16:55] =>  1:25
     CLOCK: [2025-12-27 Sa 14:30]--[2025-12-27 Sa 15:18] =>  0:48
     :END:
*** Cache [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-12-09 Di 15:55]--[2025-12-09 Di 16:30] =>  0:35
    CLOCK: [2025-12-05 Fr 17:15]--[2025-12-05 Fr 18:25] =>  1:10
    :END:
*** Generator [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-12-12 Fr 15:33]--[2025-12-12 Fr 15:56] =>  0:23
    CLOCK: [2025-12-11 Do 16:01]--[2025-12-11 Do 16:01] =>  0:00
    CLOCK: [2025-12-11 Do 14:30]--[2025-12-11 Do 15:57] =>  1:27
    CLOCK: [2025-12-10 Mi 14:28]--[2025-12-10 Mi 16:19] =>  1:51
    CLOCK: [2025-12-09 Di 16:31]--[2025-12-09 Di 17:04] =>  0:33
    :END:
    So now that the HostGenerator is capable of generating single Hosts, I
    want to look into parallelizing that. Which should not be hard or
    surprising. But I would like to have control over the number of generator
    threads, as I did in my last attempt in Go.
*** Blacklist [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-12-09 Di 15:40]--[2025-12-09 Di 15:51] =>  0:11
    CLOCK: [2025-12-09 Di 14:56]--[2025-12-09 Di 15:37] =>  0:41
    CLOCK: [2025-12-08 Mo 16:53]--[2025-12-08 Mo 20:00] =>  3:07
    :END:
*** Scanner [6/7]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-03 Sa 14:15]--[2026-01-03 Sa 15:27] =>  1:12
    CLOCK: [2026-01-02 Fr 19:12]--[2026-01-03 Sa 00:49] =>  5:37
    CLOCK: [2025-12-30 Di 16:22]--[2025-12-30 Di 17:15] =>  0:53
    CLOCK: [2025-12-27 Sa 18:28]--[2025-12-27 Sa 21:10] =>  2:42
    CLOCK: [2025-12-27 Sa 17:04]--[2025-12-27 Sa 18:21] =>  1:17
    CLOCK: [2025-12-27 Sa 14:03]--[2025-12-27 Sa 14:30] =>  0:27
    CLOCK: [2025-12-26 Fr 21:50]--[2025-12-26 Fr 22:48] =>  0:58
    CLOCK: [2025-12-26 Fr 17:43]--[2025-12-26 Fr 18:21] =>  0:38
    CLOCK: [2025-12-26 Fr 15:13]--[2025-12-26 Fr 16:10] =>  0:57
    :END:
**** TODO Be specific, please [5/5]
     :LOGBOOK:
     CLOCK: [2025-12-31 Mi 13:40]--[2025-12-31 Mi 14:29] =>  0:49
     CLOCK: [2025-12-30 Di 18:09]--[2025-12-30 Di 20:43] =>  2:34
     :END:
***** DONE HTTP(S)
      CLOSED: [2025-12-31 Mi 14:31]
***** DONE DNS
      CLOSED: [2025-12-31 Mi 14:31]
***** SUSPENDED SNMP
      CLOSED: [2026-01-02 Fr 16:19]
      There is a package called pysnmp, but the example code from the very
      repo does not work on my development machine. ???
      It works on FreeBSD, but not on Debian Trixie.
***** DONE Telnet
      CLOSED: [2026-01-02 Fr 17:27]
      :LOGBOOK:
      CLOCK: [2026-01-02 Fr 16:52]--[2026-01-02 Fr 17:27] =>  0:35
      CLOCK: [2026-01-02 Fr 16:24]--[2026-01-02 Fr 16:43] =>  0:19
      :END:
***** DONE Finger
      CLOSED: [2025-12-31 Mi 14:55]
      :LOGBOOK:
      CLOCK: [2025-12-31 Mi 14:38]--[2025-12-31 Mi 14:55] =>  0:17
      :END:
      I know it's naive to assume there are any finger servers out there on
      the open Internet.
      But that also means *if* I ever catch one, it'll be like the gem of my
      data collection.
**** DONE Rethink the interface
     CLOSED: [2025-12-30 Di 16:17]
     :LOGBOOK:
     CLOCK: [2025-12-29 Mo 15:00]--[2025-12-29 Mo 17:36] =>  2:36
     CLOCK: [2025-12-28 So 16:21]--[2025-12-28 So 16:31] =>  0:10
     :END:
     I think I should create the interface in a way that is easier to test, at
     least for manual testing.
     Ideally, the actual scanning functions should just take an IP address and
     a port number.
*** XFR [0/1]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2026-01-03 Sa 15:28]--[2026-01-03 Sa 15:29] =>  0:01
    CLOCK: [2025-12-24 Mi 15:13]--[2025-12-24 Mi 15:30] =>  0:17
    CLOCK: [2025-12-23 Di 12:40]--[2025-12-23 Di 16:49] =>  4:09
    CLOCK: [2025-12-22 Mo 18:20]--[2025-12-22 Mo 22:34] =>  4:14
    CLOCK: [2025-12-22 Mo 17:56]--[2025-12-22 Mo 18:03] =>  0:07
    CLOCK: [2025-12-22 Mo 16:04]--[2025-12-22 Mo 17:24] =>  1:20
    CLOCK: [2025-12-21 So 18:38]--[2025-12-21 So 22:29] =>  3:51
    CLOCK: [2025-12-20 Sa 14:02]--[2025-12-20 Sa 19:58] =>  5:56
    CLOCK: [2025-12-19 Fr 15:20]--[2025-12-19 Fr 20:38] =>  5:18
    CLOCK: [2025-12-13 Sa 15:28]--[2025-12-13 Sa 17:17] =>  1:49
    CLOCK: [2025-12-12 Fr 16:45]--[2025-12-12 Fr 17:06] =>  0:21
    :END:
**** TODO Figure out the mechanics
     :LOGBOOK:
     CLOCK: [2026-01-03 Sa 16:09]--[2026-01-03 Sa 19:02] =>  2:53
     CLOCK: [2026-01-03 Sa 15:29]--[2026-01-03 Sa 15:42] =>  0:13
     :END:
     I still haven't made up my mind how I want to feed zones to transfer to
     the XFRProcessor.
     In earlier incarnations, I used to have the Generator feed hostnames to
     the XFR subsystem, but for ... reasons, I want both of them to be able to
     run in isolation.
*** Web Interface [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
*** Nexus [0/0]
    :PROPERTIES:
    :COOKIE_DATA: todo recursive
    :VISIBILITY: children
    :END:
    :LOGBOOK:
    CLOCK: [2025-12-25 Do 18:12]--[2025-12-25 Do 18:12] =>  0:00
    CLOCK: [2025-12-24 Mi 15:31]--[2025-12-24 Mi 16:25] =>  0:54
    CLOCK: [2025-12-12 Fr 15:26]--[2025-12-12 Fr 15:33] =>  0:07
    CLOCK: [2025-12-11 Do 16:09]--[2025-12-11 Do 17:22] =>  1:13
    :END:
**** Control [0/0]
     :PROPERTIES:
     :COOKIE_DATA: todo recursive
     :VISIBILITY: children
     :END:
     :LOGBOOK:
     CLOCK: [2025-12-25 Do 21:50]--[2025-12-25 Do 22:26] =>  0:36
     CLOCK: [2025-12-25 Do 18:12]--[2025-12-25 Do 18:45] =>  0:33
     :END:
     The control module implements data types for communicating with the
     subsystems, for starting and stopping subsystems or single worker
     threads.
*** Main [0/0]
** Bugs [0/0]
   :PROPERTIES:
   :COOKIE_DATA: todo recursive
   :VISIBILITY: children
   :END:
